benchmarks/protocols/templates/RELEASE_MANIFEST_TEMPLATE.yaml
schema_version: "1.0"
run:
  run_id: "<generated-run-id>"
  purpose: "regression|public|held_out|fault|scale"
  certification_candidate: false
  claim_level_target: "C1|C2|C3|C4"
  correlation_id: "<opaque-id>"

inputs:
  datasets:
    - dataset_record_id: "<dataset-id>@<version>"
      archive_sha256: "<sha256>"
      normalized_sha256: "<sha256>"
      transform_id: "<transform-id>"
      transform_config_sha256: "<sha256>"
      query_pack_id: "<query-pack-id>"
      judgment_pack_id: "<judgment-pack-id-or-not-applicable>"
  systems:
    - name: "trace-lite|trace|baseline"
      code_revision: "<commit-or-build-id>"
      worktree_state: "clean|documented-dirty"
      configuration_sha256: "<sha256>"
      model_fingerprints: []
      projection_or_release_id: "<id-or-not-applicable>"

execution:
  query_classes: []
  retrieval_profiles: []
  required_channels: []
  prohibited_fallbacks:
    - mock_llm
    - synthetic_dataset
    - sample_dataset
    - forced_flat_search
    - missing_judgments
  warmup_policy: "<explicit-policy>"
  concurrency: 1
  environment_capture: required

acceptance:
  required_metrics: []
  required_fault_checks: []
  required_resource_measurements: []
  required_evidence_bundle_sample_count: 0

outputs:
  external_artifact_root: "<approved-path-key>"
  query_level_results: required
  aggregate_metrics: required
  error_and_exclusion_report: required
  environment_report: required
  manifest_verification_report: required

failure_policy:
  on_missing_dataset: fail_closed
  on_checksum_mismatch: fail_closed
  on_prohibited_fallback: fail_closed
  on_provider_unavailable: fail_closed
  on_missing_required_metric: fail_closed